---

C#Visual BasicVisual C++

Revit 2024 API
---
PrintSetup..::..Rename Method
PrintSetup Class See Also Send Feedback
---

Rename the current print setting with the specified name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public bool Rename(
    	string newName
    )

Visual Basic
---

    Public Function Rename ( _
    	newName As String _
    ) As Boolean

Visual C++
---

    public:
    bool Rename(
    	String^ newName
    )

#### Parameters

newName
    Type: System..::..Stringprint setting name to be renamed as.

#### Return Value

False if Rename operation fails, otherwise true.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the input newName already exists in current print setting list. |

# See Also

PrintSetup Class

Autodesk.Revit.DB Namespace